flatpak.org
#+TITLE: Flatpak, literate and reproducible
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+OPTIONS: toc:2 num:t
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:text :comments no

* Purpose
Reproducible Flatpak state from your dotfiles, Guix style. One manifest file is the source of truth. Each line declares origin, id, branch, and scope. Scope is either =user= or =system=. The apply step is additive by default; exact enforcement with removals is opt in.

* Single manifest
Columns: ORIGIN, ID, BRANCH, SCOPE. Comments and blanks allowed.
#+BEGIN_SRC text :tangle linux/.flatpak/manifest/apps.tsv
# origin     id                              branch   scope
flathub      com.github.tchx84.Flatseal      stable   user
flathub	app.zen_browser.zen	stable	user
flathub	cc.arduino.IDE2	stable	user
flathub	com.discordapp.Discord	stable	user
flathub	com.github.qarmin.czkawka	stable	user
flathub	com.leinardi.gwe	stable	user
flathub	com.logseq.Logseq	stable	user
flathub	com.rustdesk.RustDesk	stable	user
flathub	com.vscodium.codium	stable	user
flathub	io.github.qwersyk.Newelle	stable	user
flathub	io.github.ungoogled_software.ungoogled_chromium	stable	user
flathub	io.github.webcamoid.Webcamoid	stable	user
flathub	io.mgba.mGBA	stable	user
flathub	md.obsidian.Obsidian	stable	user
flathub	net.davidotek.pupgui2	stable	user
flathub	net.rpcs3.RPCS3	stable	user
flathub	one.ablaze.floorp	stable	user
flathub	org.duckstation.DuckStation	stable	user
flathub	org.freac.freac	stable	user
flathub	org.jdownloader.JDownloader	stable	user
flathub	org.keepassxc.KeePassXC	stable	user
flathub	org.ppsspp.PPSSPP	stable	user
flathub	org.telegram.desktop	stable	user
flathub	org.upscayl.Upscayl	stable	user
flathub	us.zoom.Zoom	stable	user
flathub de.leopoldluley.Clapgrep stable user
flathub io.github.josephmawa.Bella stable user
flathub org.zotero.Zotero stable user
pied-origin	com.mikeasoft.pied	master	user
# Examples seeded. Edit freely, or run capture to import live state.
# flathub    com.vscodium.codium             stable   user
# pied-origin com.mikeasoft.pied             master   system
#+END_SRC

* Remotes setup
Idempotent helper to ensure remotes exist before applying the manifest. Adjust the Pied URL if you use a custom one.
#+BEGIN_SRC bash :tangle all/.local/bin/flatpak-remotes-setup :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

unset_ssl() { unset SSL_CERT_FILE SSL_CERT_DIR CURL_CA_BUNDLE GIT_SSL_CAINFO; }

add_remote() {
  local scope="$1" name="$2" url="$3"
  unset_ssl
  if [ "$scope" = "system" ]; then
    if flatpak remote-list --columns=name | grep -qx "$name"; then return 0; fi
    if ! "${CLEAN_ENV[@]}" flatpak remote-add --if-not-exists "$name" "$url"; then
      mkdir -p "$HOME/.cache/flatpak-remotes"
      local f="$HOME/.cache/flatpak-remotes/${name}.flatpakrepo"
      curl -fsSL "$url" -o "$f"
      "${CLEAN_ENV[@]}" flatpak remote-add --if-not-exists --from "$name" "$f"
    fi
  else
    if flatpak --user remote-list --columns=name | grep -qx "$name"; then return 0; fi
    if ! "${CLEAN_ENV[@]}" flatpak --user remote-add --if-not-exists "$name" "$url"; then
      mkdir -p "$HOME/.cache/flatpak-remotes"
      local f="$HOME/.cache/flatpak-remotes/${name}.flatpakrepo"
      curl -fsSL "$url" -o "$f"
      "${CLEAN_ENV[@]}" flatpak --user remote-add --if-not-exists --from "$name" "$f"
    fi
  fi
}

# Flathub for both scopes
add_remote system flathub https://dl.flathub.org/repo/flathub.flatpakrepo
add_remote user   flathub https://dl.flathub.org/repo/flathub.flatpakrepo

# Pied: set the real URL if you have one (placeholder keeps idempotence)
if ! flatpak remote-list --columns=name | grep -qx pied-origin; then
  add_remote system pied-origin https://dl.flathub.org/repo/flathub.flatpakrepo || true
fi
#+END_SRC

* Capture live state into the manifest
Merges your current user and system apps into =apps.tsv=. Keeps comments. Does not remove existing lines.
#+BEGIN_SRC bash :tangle all/.local/bin/flatpak-capture :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail
OUT="${HOME}/.dotfiles/linux/.flatpak/manifest/apps.tsv"

# Run flatpak in a clean env to avoid SSL/Guix contamination
CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

dump_scope() { # user|system
  local scope="$1"
  if [ "$scope" = user ]; then
    "${CLEAN_ENV[@]}" flatpak --user list --app --columns=origin,application,branch
  else
    "${CLEAN_ENV[@]}" flatpak --system list --app --columns=origin,application,branch
  fi | awk -v s="$scope" -F '\t' 'NF>=3 {print $1 "\t" $2 "\t" $3 "\t" s}'
}

tmp="$(mktemp)"; trap 'rm -f "$tmp"' EXIT

{
  # keep comments / blanks
  [ -f "$OUT" ] && grep -E '^\s*#|^\s*$' "$OUT" || true
  # merge existing data + fresh dumps, uniq
  {
    [ -f "$OUT" ] && grep -Ev '^\s*#|^\s*$' "$OUT" || true
    dump_scope user
    dump_scope system
  } | awk -F'\t' 'NF>=4 {print $1 "\t" $2 "\t" $3 "\t" $4}' | sort -u
} > "$tmp"

mv "$tmp" "$OUT"
echo "Wrote $OUT"
#+END_SRC

* Diff plan
Shows what would be installed and what would be removed to match the manifest.
#+BEGIN_SRC bash :tangle all/.local/bin/flatpak-diff :shebang "#!/usr/bin/env bash"
set -euo pipefail
MAN="${HOME}/.dotfiles/linux/.flatpak/manifest/apps.tsv"

desired_ids(){ awk '$0!~/^#/ && NF>=4{print $2"\t"$4}' "$MAN" | sort -u; }
installed_ids(){
  { flatpak --user list --app --columns=application | awk 'NF{print $1"\tuser"}'
    flatpak --system list --app --columns=application | awk 'NF{print $1"\tsystem"}'; } \
  | sort -u
}

d="$(mktemp)"; i="$(mktemp)"; trap 'rm -f "$d" "$i"' EXIT
desired_ids >"$d"; installed_ids >"$i"

# desired minus installed -> to install
echo "[plan] to install:"
join -v1 -t $'\t' <(cut -f1 "$d") <(cut -f1 "$i") \
  | while read -r id; do grep -F "$id" "$d" | sed 's/^/  + /'; done || true

# installed minus desired -> to uninstall
echo "[plan] to uninstall:"
join -v1 -t $'\t' <(cut -f1 "$i") <(cut -f1 "$d") \
  | while read -r id; do grep -F "$id" "$i" | sed 's/^/  - /'; done || true
#+END_SRC

* Apply manifest with safe elevation
Default is additive only. Exact enforcement with removals requires =ENFORCE=1 UNINSTALL=1=. System scoped actions first try through Polkit. If Polkit cannot authorize, the script retries the specific command with =sudo flatpak ...=. User scoped actions never use sudo.
#+BEGIN_SRC bash :tangle all/.local/bin/flatpak-apply :shebang "#!/usr/bin/env bash"
# ~/.local/bin/flatpak-apply
#!/usr/bin/env bash
set -euo pipefail
MAN="${HOME}/.dotfiles/linux/.flatpak/manifest/apps.tsv"
ENFORCE="${ENFORCE:-0}"
UNINSTALL="${UNINSTALL:-0}"
FORCE_SUDO_SYSTEM="${FORCE_SUDO_SYSTEM:-0}"

# Carry through terminal + UTF-8; include ~/.local/bin so helpers resolve.
CLEAN_LANG="${LANG:-C.UTF-8}"
CLEAN_TERM="${TERM:-xterm-256color}"
CLEAN_PATH="/usr/sbin:/usr/bin:/bin:${HOME}/.local/bin"
CLEAN_ENV=(env -i HOME="$HOME" PATH="$CLEAN_PATH"
  LANG="$CLEAN_LANG" LC_ALL="$CLEAN_LANG"
  TERM="$CLEAN_TERM"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

unset_ssl(){ unset SSL_CERT_FILE SSL_CERT_DIR CURL_CA_BUNDLE GIT_SSL_CAINFO; }

ensure_remotes(){
  local helper="$HOME/.local/bin/flatpak-remotes-setup"
  if [ -x "$helper" ]; then
    "${CLEAN_ENV[@]}" "$helper" || true
  fi
}

run_fp(){ local scope="$1"; shift; unset_ssl
  if [ "$scope" = system ] && [ "$FORCE_SUDO_SYSTEM" = 1 ]; then sudo "${CLEAN_ENV[@]}" flatpak "$@"; return; fi
  if "${CLEAN_ENV[@]}" flatpak "$@"; then return; fi
  [ "$scope" = system ] && { echo "Retrying with sudo: flatpak $*" >&2; sudo "${CLEAN_ENV[@]}" flatpak "$@"; }
}

already_installed(){ local id="$1" scope="$2"
  if [ "$scope" = user ]; then "${CLEAN_ENV[@]}" flatpak --user list --app --columns=application | grep -qx "$id"
  else "${CLEAN_ENV[@]}" flatpak --system list --app --columns=application | grep -qx "$id"; fi
}

apply_installs(){
  awk '$0!~/^#/ && NF>=4{print $1"\t"$2"\t"$3"\t"$4}' "$MAN" |
  while IFS=$'\t' read -r origin id branch scope; do
    [ -n "$origin$id$branch$scope" ] || continue
    already_installed "$id" "$scope" && continue
    args=(install -y); [ "$scope" = user ] && args+=(--user) || args+=(--system)
    run_fp "$scope" "${args[@]}" "$origin" "$id" "$branch"
  done
}

compute_extras(){ local desired installed; desired="$(mktemp)"; installed="$(mktemp)"; trap 'rm -f "$desired" "$installed"' RETURN
  awk '$0!~/^#/ && NF>=4{print $2"\t"$4}' "$MAN" | sort -u >"$desired"
  { "${CLEAN_ENV[@]}" flatpak --user list --app --columns=application | awk 'NF{print $1"\tuser"}'
    "${CLEAN_ENV[@]}" flatpak --system list --app --columns=application | awk 'NF{print $1"\tsystem"}'; } | sort -u >"$installed"
  join -v2 -t $'\t' <(cut -f1 "$desired") "$installed"
}

apply_uninstalls(){
  [ "$ENFORCE" = 1 ] && [ "$UNINSTALL" = 1 ] || return 0
  compute_extras | while read -r id scope; do
    if [ "$scope" = user ]; then "${CLEAN_ENV[@]}" flatpak --user uninstall -y "$id" || true
    else run_fp system uninstall -y "$id" || true; fi
  done
}

ensure_remotes; apply_installs; apply_uninstalls; echo "Done."
#+END_SRC

* Make targets
Include directly with =make -f all/.mk/flatpak.mk <target>= or add to your main Makefile with =-include all/.mk/flatpak.mk=.
#+BEGIN_SRC makefile :tangle all/.mk/flatpak.mk :padline no :comments none
# Flatpak Make targets fragment. Safe to include or run standalone.
# Requires GNU Make 3.82+.

.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: flatpak-remotes flatpak-capture flatpak-diff flatpak-sync flatpak-apply

flatpak-remotes:
| @chmod +x $(HOME)/.local/bin/flatpak-remotes-setup 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-remotes-setup

flatpak-capture:
| @chmod +x $(HOME)/.local/bin/flatpak-capture 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-capture

flatpak-diff:
| @chmod +x $(HOME)/.local/bin/flatpak-diff 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-diff

# Additive only by default
flatpak-sync: flatpak-remotes
| @chmod +x $(HOME)/.local/bin/flatpak-apply 2>/dev/null || true
| ENFORCE=0 UNINSTALL=0 $(HOME)/.local/bin/flatpak-apply

# Enforce exact match. Set both flags to permit removals.
# Examples:
#   ENFORCE=1 UNINSTALL=1 make -f all/.mk/flatpak.mk flatpak-apply
#   FORCE_SUDO_SYSTEM=1 ENFORCE=1 UNINSTALL=1 make -f all/.mk/flatpak.mk flatpak-apply
flatpak-apply: flatpak-remotes
| @chmod +x $(HOME)/.local/bin/flatpak-apply 2>/dev/null || true
| ENFORCE=${ENFORCE} UNINSTALL=${UNINSTALL} FORCE_SUDO_SYSTEM=${FORCE_SUDO_SYSTEM} $(HOME)/.local/bin/flatpak-apply

# Flatpak bridge
bridge-flatpak: tangle stow
| if [ -x "$(HOME)/.local/bin/flatpak-desktop-bridge" ]; then \
|   "$(HOME)/.local/bin/flatpak-desktop-bridge"; \
| else \
|   echo "❌ Missing $(HOME)/.local/bin/flatpak-desktop-bridge. Tangle and stow first."; \
|   exit 1; \
| fi

bridge-flatpak-reset:
| if [ -x "$(HOME)/.local/bin/flatpak-desktop-bridge-reset" ]; then \
|   "$(HOME)/.local/bin/flatpak-desktop-bridge-reset"; \
| else \
|   echo "❌ Missing $(HOME)/.local/bin/flatpak-desktop-bridge-reset. Tangle and stow first."; \
|   exit 1; \
| fi

#+END_SRC

** Flatpak env file
So Flatpak apps register with your desktop without hacks.
#+begin_src conf :tangle linux/.config/environment.d/30-flatpak-exports.conf :mkdirp yes
XDG_DATA_DIRS=/usr/local/share:/usr/share:$HOME/.local/share/flatpak/exports/share:/var/lib/flatpak/exports/share
#+end_src

* Usage
1. Tangle and stow:
#+BEGIN_SRC sh
make tangle && cd ~/.dotfiles && stow all linux debian think
#+END_SRC

2. See plan:
#+BEGIN_SRC sh
make -f all/.mk/flatpak.mk flatpak-diff
#+END_SRC

3. Additive sync:
#+BEGIN_SRC sh
make -f all/.mk/flatpak.mk flatpak-sync
#+END_SRC

4. Enforce exact state, allowing removals:
#+BEGIN_SRC sh
ENFORCE=1 UNINSTALL=1 make -f all/.mk/flatpak.mk flatpak-apply
# In a TTY without Polkit:
FORCE_SUDO_SYSTEM=1 ENFORCE=1 UNINSTALL=1 make -f all/.mk/flatpak.mk flatpak-apply
#+END_SRC

5. Capture any ad hoc installs back into git:
#+BEGIN_SRC sh
make -f all/.mk/flatpak.mk flatpak-capture
git add linux/.flatpak/manifest/apps.tsv && git commit -m "Update Flatpak manifest"
#+END_SRC

* Note on the earlier tangle error
This file sets =#+PROPERTY: header-args:text :comments no= so =text= blocks tangle cleanly even if your global defaults use =:comments both=. Bash and Makefile blocks keep your normal comment behavior.
