linux/.local/bin/flatpak-capture
#!/usr/bin/env bash
# Capture live state into the manifest
# Merges your current user and system apps into =apps.tsv=. Keeps comments. Does not remove existing lines.

# [[file:../../../flatpak.org::*Capture live state into the manifest][Capture live state into the manifest:1]]
#!/usr/bin/env bash
set -euo pipefail
OUT="${HOME}/.dotfiles/linux/.flatpak/manifest/apps.tsv"

# Run flatpak in a clean env to avoid SSL/Guix contamination
CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

dump_scope() { # user|system
  local scope="$1"
  if [ "$scope" = user ]; then
    "${CLEAN_ENV[@]}" flatpak --user list --app --columns=origin,application,branch
  else
    "${CLEAN_ENV[@]}" flatpak --system list --app --columns=origin,application,branch
  fi | awk -v s="$scope" -F '\t' 'NF>=3 {print $1 "\t" $2 "\t" $3 "\t" s}'
}

tmp="$(mktemp)"; trap 'rm -f "$tmp"' EXIT

{
  # keep comments / blanks
  [ -f "$OUT" ] && grep -E '^\s*#|^\s*$' "$OUT" || true
  # merge existing data + fresh dumps, uniq
  {
    [ -f "$OUT" ] && grep -Ev '^\s*#|^\s*$' "$OUT" || true
    dump_scope user
    dump_scope system
  } | awk -F'\t' 'NF>=4 {print $1 "\t" $2 "\t" $3 "\t" $4}' | sort -u
} > "$tmp"

mv "$tmp" "$OUT"
echo "Wrote $OUT"
# Capture live state into the manifest:1 ends here
